package com.dms.base.baseapplication.model;

public class HealthEntity {

    /**
     * content : 孕妇感冒最令人担心的莫过于疾病及治疗对胎儿的影响。前面我们已经讲述普通感冒多由鼻病毒、合胞病毒、流感病毒、腺病毒、副流感病毒、肠道病毒等引起。一般说来普通感冒极少引起胎儿畸形，但流感及流感病毒有一定的致畸作用。除了生物因子外，某些药物也有致畸作用，如某些镇静剂，尤其是曾经用于治疗妊娠呕吐及失眠的，称为"反应停"（又名酞胺哌啶酮），切不可使用，它可引起短肢或无肢畸形。此外，某些抗生素也可对胎儿神经系统造成损害，尤其是第八对与听觉有关的神经，其中最常见的抗生素是链霉素。另外，四环素可影响胎儿骨骼及牙齿的发育，新生霉素可导致白内障和短指等。诚然，X射线和放射性同位素的α、β、γ射线也有致畸作用。因此孕妇感冒要避免与这些射线的接触。还有不少报道妊娠早期体温升高可影响胎儿中枢神经系统发育，甚至导致产生无脑儿，脊髓裂等严重畸形，因此对孕妇感冒的高烧要积极处理，最好用物理降温方法，必要时用解热药。切不可认为天然药物没有副作用，因此用中药治疗孕妇感冒或其他疾病切不可用猛烈的攻下药以及慎用行气破滞药物与大辛大热药物，下面列出禁用药物与慎用药物：（l）禁用药物：巴豆、芫菁、斑蟊、水蛭、虻虫、乌头、天雄、野葛、水银、牛膝、薏苡仁、三棱、蜈蚣、芜花、代赭石、麝香、大戟、蝉蜕、雄黄、雌黄、天南星等。（2）慎用药物：红花、桃仁、大黄、槐花、皂角、枳实、芒硝、附子、干姜、肉桂等。因此，原则上孕妇感冒除了注意上述各点外，也可按常人分型治疗。这里介绍明末清初一代名医傅青主治疗妊娠口干咽痛病例一则，可供有关医生及患者参考，其方名为润燥安胎汤，药用熟地、生地、山萸肉、麦冬、五味子、阿胶、黄芩、益母草。该方补肾补肺而兼安胎，可为孕妇感冒及上呼吸道感染借鉴之用。如果孕妇感受风寒而兼气虚可用补中益气汤，药用黄芪、炙甘草、人参、当归、陈皮、升麻、柴胡、白术。如果孕妇外感夹湿可选用升阳益胃汤：药用黄芪、人参、半夏、炙甘草、羌活、独活、防风、炒白芍、陈皮、炒白术、茯苓、泽泻、柴胡、黄连、生姜、大枣。
     * id : 8583
     * title : 小心孕妇流感的治疗
     */

    private String content;
    private int id;
    private String title;

    public String getContent() {
        return content;
    }

    public void setContent(String content) {
        this.content = content;
    }

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }
}
